In [1]:
import pandas as pd
from pandas import DataFrame, Series

In [275]:
data = DataFrame.from_csv('Suicides_in_India_2001-2014.csv', index_col = None)

In [357]:
data_to_add = DataFrame.from_csv('Social_status_of_suicide_victims_state_2001-2012.csv', index_col = None)

In [358]:
data_to_add.head()

         STATE/UT  Year            CAUSE  Male  Female  Total
0  ANDHRA PRADESH  2001    Never Married   819     591   1410
1  ANDHRA PRADESH  2001          Married  5135    3135   8270
2  ANDHRA PRADESH  2001  Widowed/Widower   183     236    419
3  ANDHRA PRADESH  2001         Divorcee    47      43     90
4  ANDHRA PRADESH  2001        Seperated   195     138    333

In [222]:
data_to_add = data_to_add.drop(['Transgender'],axis=1)

In [359]:
data_to_add = data_to_add.drop(data_to_add.columns[data_to_add.columns.str.contains('Total')],axis=1)

In [360]:
data_to_add = DataFrame(data_to_add.set_index(['STATE/UT','Year','CAUSE']).stack()).reset_index()

In [117]:
data.Age_group.unique()

array(['0-14', '15-29', '30-44', '45-59', '60+', '0-100+'], dtype=object)

In [361]:
data_to_add.head()

         STATE/UT  Year            CAUSE level_3     0
0  ANDHRA PRADESH  2001    Never Married    Male   819
1  ANDHRA PRADESH  2001    Never Married  Female   591
2  ANDHRA PRADESH  2001          Married    Male  5135
3  ANDHRA PRADESH  2001          Married  Female  3135
4  ANDHRA PRADESH  2001  Widowed/Widower    Male   183

In [330]:
# df.columns = pd.MultiIndex.from_product([df.columns, ['C']])

data_to_add = data_to_add.set_index(['STATE/UT','Year','CAUSE'])

data_to_add_male = data_to_add[data_to_add.columns[data_to_add.columns.str.contains('Male')]]
data_to_add_male.columns = pd.MultiIndex.from_product([['Male'],data_to_add_male.columns])

data_to_add_female = data_to_add[data_to_add.columns[data_to_add.columns.str.contains('Female')]]
data_to_add_female.columns = pd.MultiIndex.from_product([['Female'],data_to_add_female.columns])

In [331]:
data_to_add_male.head()

                                                            Male  \
                                              Male upto 14 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                                 0
                    Service (Government)                       0
                    Service (Private)                          1
                    Public Sector Undertaking                  0
                    Student                                   56

                                                                \
                                              Male 15-29 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                               0
                    Service (Government)                    34
                    Service (Private)                      250
                    Public Sector Undertaking               32
                    Student                                202

                                                                \
                                              Male 30-44 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                               0
                    Service (Government)                    57
                    Service (Private)                      275
                    Public Sector Undertaking               36
                    Student                                 19

                                                                \
                                              Male 45-59 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                               0
                    Service (Government)                    44
                    Service (Private)                      138
                    Public Sector Undertaking               29
                    Student                                 18


                                              Male 60 years and above
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                                      0
                    Service (Government)                            0
                    Service (Private)                              10
                    Public Sector Undertaking                      13
                    Student                                         0

In [332]:
data_to_add = pd.concat([data_to_add_male,data_to_add_female], axis=1)

In [333]:
data_to_add.head()

                                                            Male  \
                                              Male upto 14 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                                 0
                    Service (Government)                       0
                    Service (Private)                          1
                    Public Sector Undertaking                  0
                    Student                                   56

                                                                \
                                              Male 15-29 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                               0
                    Service (Government)                    34
                    Service (Private)                      250
                    Public Sector Undertaking               32
                    Student                                202

                                                                \
                                              Male 30-44 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                               0
                    Service (Government)                    57
                    Service (Private)                      275
                    Public Sector Undertaking               36
                    Student                                 19

                                                                \
                                              Male 45-59 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                               0
                    Service (Government)                    44
                    Service (Private)                      138
                    Public Sector Undertaking               29
                    Student                                 18

                                                                       \
                                              Male 60 years and above
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                                      0
                    Service (Government)                            0
                    Service (Private)                              10
                    Public Sector Undertaking                      13
                    Student                                         0

                                                            Female  \
                                              Female upto 14 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                                   0
                    Service (Government)                         0
                    Service (Private)                            5
                    Public Sector Undertaking                    0
                    Student                                     46

                                                                  \
                                              Female 15-29 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                              1132
                    Service (Government)                      23
                    Service (Private)                         43
                    Public Sector Undertaking                  4
                    Student                                  115

                                                                  \
                                              Female 30-44 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                               811
                    Service (Government)                      22
                    Service (Private)                         24
                    Public Sector Undertaking                  5
                    Student                                    5

                                                                  \
                                              Female 45-59 years
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                               397
                    Service (Government)                       9
                    Service (Private)                         28
                    Public Sector Undertaking                  1
                    Student                                    9


                                              Female 60 years and above
STATE/UT       Year CAUSE
ANDHRA PRADESH 2001 House Wife                                      104
                    Service (Government)                              7
                    Service (Private)                                 6
                    Public Sector Undertaking                         0
                    Student                                           0

In [334]:
data_to_add = DataFrame(data_to_add.stack(level=0).stack()).reset_index()
data_to_add.head()

         STATE/UT  Year       CAUSE level_3                    level_4       0
0  ANDHRA PRADESH  2001  House Wife  Female         Female 15-29 years  1132.0
1  ANDHRA PRADESH  2001  House Wife  Female         Female 30-44 years   811.0
2  ANDHRA PRADESH  2001  House Wife  Female         Female 45-59 years   397.0
3  ANDHRA PRADESH  2001  House Wife  Female  Female 60 years and above   104.0
4  ANDHRA PRADESH  2001  House Wife  Female       Female upto 14 years     0.0

In [362]:
data_to_add = data_to_add.rename(index=str, columns={"STATE/UT": "State", "CAUSE": "Type",'level_3': 'Gender',0:'Total'})

In [363]:
data_to_add = data_to_add[(~(data_to_add.State.str.lower().str.contains('total'))) & (data_to_add.Total > 0)]

In [364]:
data_to_add.State = data_to_add.State.str.title()

In [365]:
data_to_add['Age_group'] = '0-100+'

In [338]:
data_to_add.Age_group = data_to_add.Age_group.str.replace('Female ','')
data_to_add.Age_group = data_to_add.Age_group.str.replace('Male ','')
data_to_add.Age_group = data_to_add.Age_group.str.replace(' years','')
data_to_add.Age_group = data_to_add.Age_group.str.replace('upto ','0-')
data_to_add.Age_group = data_to_add.Age_group.str.replace(' and above','+').str.strip()
data_to_add.head()

             State  Year                  Type  Gender Age_group   Total
0   Andhra Pradesh  2001            House Wife  Female     15-29  1132.0
1   Andhra Pradesh  2001            House Wife  Female     30-44   811.0
2   Andhra Pradesh  2001            House Wife  Female     45-59   397.0
3   Andhra Pradesh  2001            House Wife  Female       60+   104.0
10  Andhra Pradesh  2001  Service (Government)  Female     15-29    23.0

In [339]:
data.Type_code.unique()

array(['Means_adopted', 'Social_Status', 'Causes', 'Professional_Profile',
       'Education_Status'], dtype=object)

In [366]:
data_to_add['Type_code'] = 'Social_Status'
data_to_add.head()

,State,Year,Type,Gender,Total,Age_group,Type_code
0,Andhra Pradesh,2001,Never Married,Male,819,0-100+,Social_Status
1,Andhra Pradesh,2001,Never Married,Female,591,0-100+,Social_Status
2,Andhra Pradesh,2001,Married,Male,5135,0-100+,Social_Status
3,Andhra Pradesh,2001,Married,Female,3135,0-100+,Social_Status
4,Andhra Pradesh,2001,Widowed/Widower,Male,183,0-100+,Social_Status

In [367]:
data = pd.concat([data,data_to_add]) 
data.head()

,Age_group,Gender,State,Total,Type,Type_code,Year
101110,15-29,Female,Andhra Pradesh,3.0,By Over Alcoholism,Means_adopted,2013
101111,30-44,Female,Andhra Pradesh,1.0,By Over Alcoholism,Means_adopted,2013
101112,45-59,Female,Andhra Pradesh,1.0,By Over Alcoholism,Means_adopted,2013
101113,15-29,Male,Andhra Pradesh,38.0,By Over Alcoholism,Means_adopted,2013
101114,30-44,Male,Andhra Pradesh,86.0,By Over Alcoholism,Means_adopted,2013

In [368]:
data[data.Year == 2014].Type_code.unique()

array(['Means_adopted', 'Social_Status', 'Education_Status',
       'Professional_Profile', 'Causes'], dtype=object)

In [369]:
data.Year.unique()

array([2013, 2014, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012])

In [370]:
data.to_csv('Suicides_in_India-2001-2014_newest.csv')

In [371]:
data.State.unique()

array(['Andhra Pradesh', 'Arunachal Pradesh', 'Assam', 'Bihar',
       'Chhattisgarh', 'Goa', 'Gujarat', 'Haryana', 'Himachal Pradesh',
       'Jammu & Kashmir', 'Jharkhand', 'Karnataka', 'Kerala',
       'Madhya Pradesh', 'Maharashtra', 'Manipur', 'Meghalaya', 'Mizoram',
       'Nagaland', 'Odisha', 'Punjab', 'Rajasthan', 'Sikkim', 'Tamil Nadu',
       'Tripura', 'Uttar Pradesh', 'Uttarakhand', 'West Bengal',
       'A & N Islands', 'Chandigarh', 'D & N Haveli', 'Daman & Diu',
       'Delhi (Ut)', 'Lakshadweep', 'Puducherry'], dtype=object)

In [396]:
data.groupby(['Year','Type_code']).Total.sum()

Year  Type_code
2001  Causes                  108506.0
      Education_Status        108506.0
      Means_adopted           108506.0
      Professional_Profile    108506.0
      Social_Status           108506.0
2002  Causes                  110417.0
      Education_Status        110417.0
      Means_adopted           110417.0
      Professional_Profile    110417.0
      Social_Status           110417.0
2003  Causes                  110851.0
      Education_Status        110851.0
      Means_adopted           110851.0
      Professional_Profile    110851.0
      Social_Status           110851.0
2004  Causes                  113697.0
      Education_Status        113697.0
      Means_adopted           113697.0
      Professional_Profile    113697.0
      Social_Status           113697.0
2005  Causes                  113914.0
      Education_Status        113914.0
      Means_adopted           113914.0
      Professional_Profile    113914.0
      Social_Status           113914.0
2006  Causes                  118112.0
      Education_Status        118112.0
      Means_adopted           118112.0
      Professional_Profile    118112.0
      Social_Status           118112.0
                                ...
2009  Causes                  127151.0
      Education_Status        127151.0
      Means_adopted           127151.0
      Professional_Profile    127151.0
      Social_Status           127151.0
2010  Causes                  134599.0
      Education_Status        134599.0
      Means_adopted           134599.0
      Professional_Profile    134599.0
      Social_Status           134599.0
2011  Causes                  135585.0
      Education_Status        135585.0
      Means_adopted           135585.0
      Professional_Profile    135585.0
      Social_Status           135585.0
2012  Causes                  120488.0
      Education_Status        135445.0
      Means_adopted           135445.0
      Professional_Profile    120488.0
      Social_Status           135445.0
2013  Causes                  134799.0
      Education_Status        134799.0
      Means_adopted           134799.0
      Professional_Profile    134799.0
      Social_Status           134799.0
2014  Causes                  131650.0
      Education_Status        131650.0
      Means_adopted           131650.0
      Professional_Profile    131650.0
      Social_Status           131650.0
Name: Total, Length: 70, dtype: float64

In [397]:
data[~(data.Year.isin([2012]))].groupby('Type_code').Total.sum()

Type_code
Causes                  1586935.0
Education_Status        1586935.0
Means_adopted           1586935.0
Professional_Profile    1586935.0
Social_Status           1586935.0
Name: Total, dtype: float64

In [422]:
n = 1722380-1707423
n

14957

In [374]:
data.Type = data.Type.str.title()

In [376]:
data = data[(~(data.Type.str.lower().str.contains('total')))]

In [389]:
es = data[data.Type_code == 'Education_Status'].groupby('Type').Total.sum()
ma = data[data.Type_code == 'Means_adopted'].groupby('Type').Total.sum()
ca = data[data.Type_code == 'Causes'].groupby('Type').Total.sum()
pp = data[data.Type_code == 'Professional_Profile'].groupby('Type').Total.sum()
ss = data[data.Type_code == 'Social_Status'].groupby('Type').Total.sum()

In [395]:
ss[ss <= n].sum()

13341.0

In [398]:
causes_2012 = DataFrame.from_csv('Suicides_by_causes_state_2001-2012.csv')

In [400]:
causes_2012 = causes_2012[causes_2012.Year == 2012]

In [409]:
causes_2012.head()

,STATE/UT,Year,CAUSE,Male upto 14 years,Male 15-29 years,Male 30-44 years,Male 45-59 years,Male 60 years and above,Total Male,Female upto 14 years,Female 15-29 years,Female 30-44 years,Female 45-59 years,Female 60 years and above,Total Female,Grand Total
0,Andhra Pradesh,2012,Bankruptcy or Sudden change in Economic,1.0,144,400,185,55,785,0.0,32,48,25,16,121,906.0
1,Andhra Pradesh,2012,Suspected/Illicit Relation,0.0,24,21,4,0,49,1.0,51,30,5,0,87,136.0
2,Andhra Pradesh,2012,Cancellation/Non-Settlement of Marriage,0.0,30,9,1,0,40,0.0,28,11,4,3,46,86.0
3,Andhra Pradesh,2012,Not having Children(Barrenness/Impotency,0.0,4,9,1,1,15,0.0,36,36,6,0,78,93.0
4,Andhra Pradesh,2012,Illness (Aids/STD),0.0,21,53,20,9,103,0.0,10,12,11,9,42,145.0

In [414]:
causes_2012['Grand Total'].sum()

266092.0

In [407]:
causes_2012 = causes_2012.reset_index()

In [408]:
causes_2012['STATE/UT'] = causes_2012['STATE/UT'].str.title()

In [413]:
causes_2012 = causes_2012[~causes_2012['STATE/UT'].str.lower().str.contains('total')]

In [419]:
causes_2012[causes_2012['CAUSE'].str.lower() == 'total']['Grand Total'].sum()

120488.0

In [420]:
data_2012 = data[data.Year == 2012]

In [421]:
data_2012.groupby(['State','Type_code']).Total.sum()

State              Type_code
A & N Islands      Causes                    121.0
                   Education_Status          121.0
                   Means_adopted             121.0
                   Professional_Profile      121.0
                   Social_Status             121.0
Andhra Pradesh     Causes                  14238.0
                   Education_Status        14238.0
                   Means_adopted           14238.0
                   Professional_Profile    14238.0
                   Social_Status           14238.0
Arunachal Pradesh  Causes                    130.0
                   Education_Status          130.0
                   Means_adopted             130.0
                   Professional_Profile      130.0
                   Social_Status             130.0
Assam              Causes                   3264.0
                   Education_Status         3264.0
                   Means_adopted            3264.0
                   Professional_Profile     3264.0
                   Social_Status            3264.0
Bihar              Causes                    759.0
                   Education_Status          759.0
                   Means_adopted             759.0
                   Professional_Profile      759.0
                   Social_Status             759.0
Chandigarh         Causes                    114.0
                   Education_Status          114.0
                   Means_adopted             114.0
                   Professional_Profile      114.0
                   Social_Status             114.0
                                            ...
Rajasthan          Professional_Profile     4821.0
                   Social_Status            4821.0
Sikkim             Causes                    181.0
                   Education_Status          181.0
                   Means_adopted             181.0
                   Professional_Profile      181.0
                   Social_Status             181.0
Tamil Nadu         Causes                  16927.0
                   Education_Status        16927.0
                   Means_adopted           16927.0
                   Professional_Profile    16927.0
                   Social_Status           16927.0
Tripura            Causes                    844.0
                   Education_Status          844.0
                   Means_adopted             844.0
                   Professional_Profile      844.0
                   Social_Status             844.0
Uttar Pradesh      Causes                   4422.0
                   Education_Status         4422.0
                   Means_adopted            4422.0
                   Professional_Profile     4422.0
                   Social_Status            4422.0
Uttarakhand        Causes                    424.0
                   Education_Status          424.0
                   Means_adopted             424.0
                   Professional_Profile      424.0
                   Social_Status             424.0
West Bengal        Education_Status        14957.0
                   Means_adopted           14957.0
                   Social_Status           14957.0
Name: Total, Length: 173, dtype: float64

In [425]:
data.Age_group.unique()

array(['15-29', '30-44', '45-59', '60+', '0-14', '14-29', '30-45', '45-60',
       '0-100+'], dtype=object)

In [427]:
data.loc[data.Age_group == '14-29','Age_group'] = '15-29'

In [442]:
data.Type_code.unique()

array(['Means_adopted', 'Social_Status', 'Causes', 'Professional_Profile',
       'Education_Status'], dtype=object)

In [458]:
sorted(data[data.Type_code=='Education_Status'].Type.unique())

['Diploma/Certificate',
 'Graduate And Above',
 'Higher Secondary/ Intermediate/ Pre-University (Upto Class-12)',
 'Matriculate/Secondary (Upto Class-10)',
 'Middle (Upto Class-8)',
 'No Education',
 'Post Graduate And Above',
 'Primary (Upto Class-5)',
 'Professionals (Mba; Etc.)',
 'Status Not Known']

In [457]:
data.Type.replace('Diploma','Diploma/Certificate',inplace=True)
data.Type.replace('Diploma/Iti/Certificate','Diploma/Certificate',inplace=True)
data.Type.replace('Graduate','Graduate And Above',inplace=True)
data.Type.replace('Hr. Secondary/Intermediate/Pre-Universit','Higher Secondary/ Intermediate/ Pre-University (Upto Class-12)',inplace=True)
data.Type.replace('Hr. Secondary/Intermediate/Pre-University','Higher Secondary/ Intermediate/ Pre-University (Upto Class-12)',inplace=True)
data.Type.replace('Matriculate/Secondary','Matriculate/Secondary (Upto Class-10)',inplace=True)
data.Type.replace('Middle','Middle (Upto Class-8)',inplace=True)
data.Type.replace('Primary','Primary (Upto Class-5)',inplace=True)

In [454]:
data.Type.replace('House Wife','Housewife',inplace=True)

In [451]:
data.Type.replace('Retired Person','Retired Persons',inplace=True)
data.Type.replace('Student','Students',inplace=True)
data.Type.replace('Unemployed Persons','Unemployed',inplace=True)
data.Type.replace('Other Causes','Other',inplace=True)
data.Type.replace('Other Statutory Body/Etc.','Other',inplace=True)
data.Type.replace('Others (Please Specify)','Other',inplace=True)

In [446]:
data.Type.replace('Building','By Jumping From (Building)',inplace=True)
data.Type.replace('By Fire-Arms','By Firearms',inplace=True)
data.Type.replace('Other Sites','By Jumping From (Other Sites)',inplace=True)
data.Type.replace('By Self Inflicting  Injury','By Self Infliction Of Injury',inplace=True)
data.Type.replace('By Other Means (Please Specify)','By Other Means',inplace=True)
data.Type.replace('By Touching Electric Wire','By Touching Electric Wires',inplace=True)
data.Type.replace('By Overdose Of Sleeping Pills','By Consuming Sleeping Pills',inplace=True)
data.Type.replace('By Jumping Off Moving Trains/Vehicles','By Jumping Off Moving Vehicles/Trains',inplace=True)

In [432]:
data.Type.replace('Other Causes (Please Specity)','Other Causes',inplace=True)
data.Type.replace('Not Having Children(Barrenness/Impotency','Not Having Children (Barrenness/Impotency)',inplace=True)
data.Type.replace('Not Having Children (Barrenness/Impotency','Not Having Children (Barrenness/Impotency)',inplace=True)
data.Type.replace('Physical Abuse (Rape,Incest Etc.)','Physical/sexual abuse',inplace=True)
data.Type.replace('Physical Abuse (Rape; Etc.)','Physical/sexual abuse',inplace=True)
data.Type.replace('Bankruptcy Or Sudden Change In Economic','Bankruptcy Or Sudden Change In Economic Status',inplace=True)
data.Type.replace('Bankruptcy Or Indebtedness','Bankruptcy Or Sudden Change In Economic Status',inplace=True)
data.Type.replace('Others','Other Causes',inplace=True)

In [434]:
data.Type.replace('Aids/Std','Illness (Aids/Std)',inplace=True)
data.Type.replace('Non Settlement Of Marriage','Cancellation/Non-Settlement Of Marriage',inplace=True)
data.Type.replace('Impotency/Infertility','Not Having Children (Barrenness/Impotency)',inplace=True)

In [437]:
data.Type.replace('Dowry Dispute','Dowry Related Issues',inplace=True)

In [459]:
data.to_csv('Suicides_in_India-2001-2014_newest.csv')